### We produce a MySQL database on Movies from a subset of IMDB's publicly available dataset. Ultimately, we will use this database to analyze what makes a movie successful, and will provide recommendations to the stakeholder on how to make a successful movie.

# Imports

In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import pymysql
pymysql.install_as_MySQLdb()
from tqdm.notebook import tqdm_notebook
import tmdbsimple as tmdb
from sqlalchemy.types import *
import os,time,json

# Functions

In [2]:
def get_movie_with_rating(movie_id):
    """Adapted from source = https://github.com/celiao/tmdbsimple"""
    # Get the movie object for the current id
    movie = tmdb.Movies(movie_id)
    
    # save the .info .releases dictionaries
    info = movie.info()
    
    releases = movie.releases()
    # Loop through countries in releases
    for c in releases['countries']:
        # if the country abbreviation==US
        if c['iso_3166_1' ] =='US':
            ## save a "certification" key in the info dict with the certification
           info['certification'] = c['certification']
    return info

In [3]:
def write_json(new_data, filename): 
    """Appends a list of records (new_data) to a json file (filename). 
    Adapted from: https://www.geeksforgeeks.org/append-to-json-file-using-python/"""  
    
    with open(filename,'r+') as file:
        # First we load existing data into a dict.
        file_data = json.load(file)
        ## Choose extend or append
        if (type(new_data) == list) & (type(file_data) == list):
            file_data.extend(new_data)
        else:
             file_data.append(new_data)
        # Sets file's current position at offset.
        file.seek(0)
        # convert back to json.
        json.dump(file_data, file)

###  We downloaded several files from IMDB’s movie data set and filtered out the subset of movies requested by the stakeholder.

In [4]:
# basics_url="https://datasets.imdbws.com/title.basics.tsv.gz"

In [5]:
# basics = pd.read_csv(basics_url, sep='\t', low_memory=False)

In [6]:
# akas_url="https://datasets.imdbws.com/title.akas.tsv.gz"

In [7]:
# akas = pd.read_csv(akas_url, sep='\t', low_memory=False)

In [8]:
# ratings_url="https://datasets.imdbws.com/title.ratings.tsv.gz"

In [9]:
# ratings = pd.read_csv(ratings_url, sep='\t', low_memory=False)

In [10]:
# basics.info()

In [11]:
# akas.info()

In [12]:
# ratings.info()

In [13]:
# basics = basics.replace({'\\N':np.nan})

In [14]:
# basics = basics.dropna(subset=['runtimeMinutes','genres'])

In [15]:
# movie_filter = basics['titleType']=='movie'

In [16]:
# basics = basics[movie_filter]

In [17]:
# basics['startYear'] = basics['startYear'].astype(float)

In [18]:
# startYear2000 = basics['startYear'] >=2000

In [19]:
# startYear2022 = basics['startYear']<=2022

In [20]:
# basics = basics[startYear2000 & startYear2022]

In [21]:
# Exclude movies that are included in the documentary category.
# documentary = basics['genres'].str.contains('documentary',case=False)
# basics = basics[~documentary]

In [22]:
# ratings = ratings.replace({'\\N':np.nan})

In [23]:
# us_filter = akas['region']=='US'

In [24]:
# akas = akas[us_filter]

In [25]:
# akas = akas.replace({'\\N':np.nan})

In [26]:
# Filter the basics table down to only include the US by using the filter akas dataframe
# keepers = basics['tconst'].isin(akas['titleId'])
# keepers

In [27]:
# basics = basics[keepers]
# basics

In [28]:
# keepers2 = ratings['tconst'].isin(akas['titleId'])
# keepers2

In [29]:
# ratings = ratings[keepers2]
# ratings

In [30]:
# basics.info()

In [31]:
# basics.head()

In [32]:
# akas.info()

In [33]:
# akas.head()

In [34]:
# ratings.info()

In [35]:
# ratings.head()

In [36]:
# example making new folder with os
# os.makedirs('Data/',exist_ok=True) 
# Confirm folder created
# os.listdir("Data/")

In [37]:
# basics.to_csv("Data/title_basics.csv.gz",compression='gzip',index=False)

In [38]:
basics = pd.read_csv("Data/title_basics.csv.gz", low_memory=False)
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [39]:
# akas.to_csv("Data/title_akas.csv.gz",compression='gzip',index=False)

In [40]:
akas = pd.read_csv("Data/title_akas.csv.gz", low_memory=False)
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0.0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0.0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0.0

In [41]:
# ratings.to_csv("Data/title_ratings.csv.gz",compression='gzip',index=False)

In [42]:
ratings = pd.read_csv("Data/title_ratings.csv.gz", low_memory=False)
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1957
1  tt0000002            5.8       263
2  tt0000005            6.2      2593
3  tt0000006            5.1       177
4  tt0000007            5.4       812

### We used an API to extract box office revenue and profit data to add to our IMDB data and perform exploratory data analysis.

In [43]:
# Install tmdbsimple (only need to run once)
#!pip install tmdbsimple

In [44]:
with open('/Users/nusratjahan/.secret/tmdb_api.json', 'r') as f:
    login = json.load(f)
## Display the keys of the loaded dict
login.keys()

dict_keys(['API Key (v3 auth)'])

In [45]:
tmdb.API_KEY =  login['API Key (v3 auth)']

In [46]:
## make a movie object using the .Movies function from tmdb
movie = tmdb.Movies(603)

In [47]:
## movie objects have a .info dictionary 
info = movie.info()
info

{'adult': False,
 'backdrop_path': '/waCRuAW5ocONRehP556vPexVXA9.jpg',
 'belongs_to_collection': {'id': 2344,
  'name': 'The Matrix Collection',
  'poster_path': '/bV9qTVHTVf0gkW0j7p7M0ILD4pG.jpg',
  'backdrop_path': '/bRm2DEgUiYciDw3myHuYFInD7la.jpg'},
 'budget': 63000000,
 'genres': [{'id': 28, 'name': 'Action'},
  {'id': 878, 'name': 'Science Fiction'}],
 'homepage': 'http://www.warnerbros.com/matrix',
 'id': 603,
 'imdb_id': 'tt0133093',
 'original_language': 'en',
 'original_title': 'The Matrix',
 'overview': 'Set in the 22nd century, The Matrix tells the story of a computer hacker who joins a group of underground insurgents fighting the vast and powerful computers who now rule the earth.',
 'popularity': 76.46,
 'poster_path': '/f89U3ADr1oiB1s9GkdPOEpXUk5H.jpg',
 'production_companies': [{'id': 79,
   'logo_path': '/tpFpsqbleCzEE2p5EgvUq6ozfCA.png',
   'name': 'Village Roadshow Pictures',
   'origin_country': 'US'},
  {'id': 372,
   'logo_path': None,
   'name': 'Groucho II Film Partnership',
   'origin_country': ''},
  {'id': 1885,
   'logo_path': '/tXMFoE8AtNdnFzWOW0aCLwl7xxS.png',
   'name': 'Silver Pictures',
   'origin_country': 'US'},
  {'id': 174,
   'logo_path': '/IuAlhI9eVC9Z8UQWOIDdWRKSEJ.png',
   'name': 'Warner Bros. Pictures',
   'origin_country': 'US'}],
 'production_countries': [{'iso_3166_1': 'US',
   'name': 'United States of America'}],
 'release_date': '1999-03-30',
 'revenue': 463517383,
 'runtime': 136,
 'spoken_languages': [{'english_name': 'English',
   'iso_639_1': 'en',
   'name': 'English'}],
 'status': 'Released',
 'tagline': 'Welcome to the Real World.',
 'title': 'The Matrix',
 'video': False,
 'vote_average': 8.2,
 'vote_count': 22883}

In [48]:
info['budget']

63000000

In [49]:
info['revenue']

463517383

In [50]:
info['imdb_id']

'tt0133093'

In [51]:
movie = tmdb.Movies('tt1361336')
info = movie.info()
info['budget']

50000000

In [52]:
# example from package README
# source = https://github.com/celiao/tmdbsimple
releases = movie.releases()
for c in releases['countries']:
    if c['iso_3166_1'] == 'US':
        print(c['certification'])

PG
PG
PG

In [53]:
## testing our function by looping through a list of ids
test_ids = ["tt0848228", "tt0332280"]
results = []
errors = []
for movie_id in test_ids:
    
    try:
        movie_info = get_movie_with_rating(movie_id)
        results.append(movie_info)
        
    except Exception as e: 
        errors.append([movie_id, e])
    
pd.DataFrame(results)

,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,imdb_id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,False,/9BBTo63ANSmhC4e6r62OJFuK2GL.jpg,"{'id': 86311, 'name': 'The Avengers Collection...",220000000,"[{'id': 878, 'name': 'Science Fiction'}, {'id'...",https://www.marvel.com/movies/the-avengers,24428,tt0848228,en,The Avengers,...,1518815515,143,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Some assembly required.,The Avengers,False,7.707,28270,PG-13
1,False,/qom1SZSENdmHFNZBXbtJAU0WTlC.jpg,None,29000000,"[{'id': 10749, 'name': 'Romance'}, {'id': 18, ...",http://www.newline.com/properties/notebookthe....,11036,tt0332280,en,The Notebook,...,115603229,123,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Behind every great love is a great story.,The Notebook,False,7.878,10188,PG-13

In [54]:
print(f"- Number of errors: {len(errors)}")
errors

- Number of errors: 0

[]

In [55]:
YEARS_TO_GET = [2000,2001]

In [56]:
errors = [ ]

In [57]:
#FOLDER = "Data/"
# Defining the JSON file to store results for year
#JSON_FILE = f'{FOLDER}tmdb_api_results_{YEAR}.json'

In [58]:
# Check if file exists
# file_exists = os.path.isfile(JSON_FILE)

In [59]:
# If it does not exist: create it
#if file_exists == False:
# save an empty dict with just "imdb_id" to the new json file.
#    with open(JSON_FILE,'w') as f:
#        json.dump([{'imdb_id':0}],f)

In [60]:
# Saving new year as the current df
#df = basics.loc[ basics['startYear']==YEAR].copy()
# saving movie ids to list
#movie_ids = df['tconst'].copy()

In [61]:
# Load existing data from json into a dataframe called "previous_df"
#previous_df = pd.read_json(JSON_FILE)

In [62]:
# filter out any ids that are already in the JSON_FILE
#movie_ids_to_get = movie_ids[~movie_ids.isin(previous_df['imdb_id'])]

In [63]:
# Start of OUTER loop
#for YEAR in tqdm_notebook(YEARS_TO_GET, desc='YEARS', position=0):
    #Get index and movie id from list
    # INNER Loop
#    for movie_id in tqdm_notebook(movie_ids_to_get,
#                                  desc=f'Movies from {YEAR}',
#                                  position=1,
#                                  leave=True):
#        try:
            # Retrieve then data for the movie id
#            temp = get_movie_with_rating(movie_id)  
            # Append/extend results to existing file using a pre-made function
#            write_json(temp,JSON_FILE)
            # Short 20 ms sleep to prevent overwhelming server
#            time.sleep(0.02)
            
#        except Exception as e:
#            errors.append([movie_id, e])
#    final_year_df = pd.read_json(JSON_FILE)
#    final_year_df.to_csv(f"{FOLDER}final_tmdb_data_{YEAR}.csv.gz", compression="gzip", index=False)

In [64]:
# print(f"- Total errors: {len(errors)}")

### We construct and export a MySQL database using our data.

We apply an ETL process on our previously saved movie data. Specifically, we will create a new MySQL database after preparing the data for a relational database. We will export our database to a .sql file in our repository using MySQL Workbench.

In [65]:
## Create a new column with the single-string genres as a list of strings
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama,[Drama]
...,...,...,...,...,...,...,...,...,...,...
85721,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019.0,NaN,74,Drama,[Drama]
85722,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019.0,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
85723,tt9916170,movie,The Rehearsal,O Ensaio,0,2019.0,NaN,51,Drama,[Drama]
85724,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
85725,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History","[Drama, History]"

In [66]:
## get the string column converted to a list of strings in each row
genres_split = basics['genres_split']

## Explode the genres and take unique entries only
unique_genres = sorted(genres_split.explode().unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [67]:
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
85724,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Action
85724,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Adventure
85724,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Thriller
85725,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",Drama
85725,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",History

In [68]:
## Save just tconst and genres_split as new df
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres

          tconst genres_split
0      tt0035423       Comedy
0      tt0035423      Fantasy
0      tt0035423      Romance
1      tt0062336        Drama
2      tt0069049        Drama
...          ...          ...
85724  tt9916190       Action
85724  tt9916190    Adventure
85724  tt9916190     Thriller
85725  tt9916362        Drama
85725  tt9916362      History

[160140 rows x 2 columns]

In [69]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [70]:
## make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')

In [71]:
# Table 1 after normalizing 'Genre'
title_genres

          tconst  genre_id
0      tt0035423         5
0      tt0035423         9
0      tt0035423        18
1      tt0062336         7
2      tt0069049         7
...          ...       ...
85724  tt9916190         0
85724  tt9916190         2
85724  tt9916190        23
85725  tt9916362         7
85725  tt9916362        11

[160140 rows x 2 columns]

In [72]:
# Manually make dataframe with named cols from .keys and .values
genre_lookup = pd.DataFrame({'Genre_Name':genre_map.keys(),'Genre_ID':genre_map.values()})
genres = genre_lookup

In [73]:
# Table 2 after normalizing 'Genre'
genres

    Genre_Name  Genre_ID
0       Action         0
1        Adult         1
2    Adventure         2
3    Animation         3
4    Biography         4
5       Comedy         5
6        Crime         6
7        Drama         7
8       Family         8
9      Fantasy         9
10   Game-Show        10
11     History        11
12      Horror        12
13       Music        13
14     Musical        14
15     Mystery        15
16        News        16
17  Reality-TV        17
18     Romance        18
19      Sci-Fi        19
20       Short        20
21       Sport        21
22   Talk-Show        22
23    Thriller        23
24         War        24
25     Western        25

In [74]:
basics.dtypes

tconst             object
titleType          object
primaryTitle       object
originalTitle      object
isAdult             int64
startYear         float64
endYear           float64
runtimeMinutes      int64
genres             object
genres_split       object
dtype: object

In [75]:
# Table 3 after discarding unnecessary information
title_basics = basics.drop(columns=['originalTitle','isAdult','titleType','genres','genres_split','endYear'])
title_basics

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126
...,...,...,...,...
85721,tt9914942,Life Without Sara Amat,2019.0,74
85722,tt9915872,The Last White Witch,2019.0,97
85723,tt9916170,The Rehearsal,2019.0,51
85724,tt9916190,Safeguard,2020.0,95
85725,tt9916362,Coven,2020.0,92

In [76]:
## Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'runtimeMinutes':Integer()}

In [77]:
connection = f"mysql+pymysql://root:AmeerahIbrahim@localhost/movies"

In [78]:
# Check if the database exists. If not, create it.
if database_exists(connection) == False:
  create_database(connection)
else:
  print('The database already exists')

The database already exists

In [79]:
database_exists(connection)

True

In [80]:
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/movies)

In [81]:
# Save to sql with dtype and index=False
title_basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

85726

In [82]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [83]:
title_ratings = ratings

In [84]:
title_ratings # Table 4

           tconst  averageRating  numVotes
0       tt0000001            5.7      1957
1       tt0000002            5.8       263
2       tt0000005            6.2      2593
3       tt0000006            5.1       177
4       tt0000007            5.4       812
...           ...            ...       ...
490701  tt9916200            8.2       221
490702  tt9916204            8.2       253
490703  tt9916348            8.3        18
490704  tt9916362            6.4      5200
490705  tt9916428            3.8        14

[490706 rows x 3 columns]

In [85]:
tmdb_data = pd.read_csv("Data/tmdb_results_combined.csv.gz", low_memory=False)
tmdb_data

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.112,2135.0,PG
2,tt0120467,0.0,/knok3mNReKqPTplnnqz7E4dd7mD.jpg,NaN,120000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 27, 'name...",NaN,19085.0,en,Vulgar,...,14904.0,87.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Everyone loves a clown... some more than others.,Vulgar,0.0,5.500,44.0,R
3,tt0120630,0.0,/t7aJ7hqsMLEoqBJk7yAXxcAVvcz.jpg,"{'id': 718551, 'name': 'Chicken Run Collection...",45000000.0,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",NaN,7443.0,en,Chicken Run,...,224834564.0,84.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,This ain't no chick flick. It's poultry in mot...,Chicken Run,0.0,6.741,4295.0,G
4,tt0120753,0.0,/3vUkQpnwbsFEQlMh9EORpvKJfpo.jpg,NaN,8000000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 53, 'name...",NaN,318.0,en,The Million Dollar Hotel,...,105983.0,122.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Everyone has something to hide.,The Million Dollar Hotel,0.0,5.906,271.0,R
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1165,tt0262432,0.0,/5ZVRnltdsQXrRWhYCw7zHU4lruz.jpg,NaN,42000.0,"[{'id': 18, 'name': 'Drama'}]",NaN,18292.0,en,George Washington,...,241816.0,90.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,"Down this twisted road, please watch over my s...",George Washington,0.0,6.700,92.0,NaN
1166,tt0266308,0.0,/amBvmIshdsSkOtvVIgxl7YSQ9Dg.jpg,"{'id': 16302, 'name': 'Battle Royale Collectio...",4500000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 53, 'name...",NaN,3176.0,ja,バトル・ロワイアル,...,30600000.0,114.0,"[{'english_name': 'Japanese', 'iso_639_1': 'ja...",Released,Could you kill your best friend?,Battle Royale,0.0,7.302,2901.0,NR
1167,tt0266408,0.0,/r7zkELMYtf8dSh8nnzwXIH4DFh1.jpg,NaN,13500000.0,"[{'id': 28, 'name': 'Action'}, {'id': 53, 'nam...",NaN,34856.0,cn,雷霆戰警,...,145969.0,92.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,Extortion. Murder. Revenge.,China Strike Force,0.0,5.192,26.0,R
1168,tt0274716,0.0,/o6ZNVRbapfqY1KSAxtMGYPg8V6k.jpg,"{'id': 997747, 'name': 'Petualangan Sherina Co...",250000.0,"[{'id': 12, 'name': 'Adventure'}, {'id': 18, '...",NaN,199324.0,id,Petualangan Sherina,...,1200000.0,111.0,"[{'english_name': 'Indonesian', 'iso_639_1': '...",Released,Will You Help Your Enemy if He’s in Danger?,Sherina's Adventure,0.0,8.200,5.0,NaN
1169,tt0303243,0.0,/eFEA6ftIihZnsh3lUYuuR8l8u3D.jpg,NaN,1900000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 35, 'name...",NaN,45861.0,zh,幸福时光,...,240093.0,102.0,"[{'english_name': 'Mandarin', 'iso_639_1': 'zh...",Released,An hilarious look at life and the pursuit of h...,Happy Times,0.0,7.100,40.0,NaN

In [86]:
# Table 5 only need to keep the imdb_id, revenue, budget, and certification columns
tmdb_data = tmdb_data[['imdb_id','budget','revenue','certification']]
tmdb_data

        imdb_id      budget      revenue certification
0             0         NaN          NaN           NaN
1     tt0118694    150000.0   12854953.0            PG
2     tt0120467    120000.0      14904.0             R
3     tt0120630  45000000.0  224834564.0             G
4     tt0120753   8000000.0     105983.0             R
...         ...         ...          ...           ...
1165  tt0262432     42000.0     241816.0           NaN
1166  tt0266308   4500000.0   30600000.0            NR
1167  tt0266408  13500000.0     145969.0             R
1168  tt0274716    250000.0    1200000.0           NaN
1169  tt0303243   1900000.0     240093.0           NaN

[1170 rows x 4 columns]

In [88]:
title_ratings.dtypes

tconst            object
averageRating    float64
numVotes           int64
dtype: object

In [93]:
key_len = title_ratings['tconst'].fillna('').map(len).max()
df_schema = {
    "tconst": String(key_len+1),
    'averageRating':Float(),
    'numVotes':Integer()}

In [94]:
title_ratings.to_sql('title_ratings',engine,dtype=df_schema,if_exists='replace',index=False)

490706

In [95]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [89]:
title_genres.dtypes

tconst      object
genre_id     int64
dtype: object

In [96]:
key_len = title_genres['tconst'].fillna('').map(len).max()
df_schema = {
    "tconst": Text(key_len+1),
    'genre_id':Integer()}

In [97]:
title_genres.to_sql('title_genres',engine,dtype=df_schema,if_exists='replace',index=False)

160140

In [90]:
genres.dtypes

Genre_Name    object
Genre_ID       int64
dtype: object

In [92]:
## Set the genres index and use index=True 
genres.set_index('Genre_ID').to_sql('genres',engine,index=True)

26

In [91]:
tmdb_data.dtypes

imdb_id           object
budget           float64
revenue          float64
certification     object
dtype: object

In [109]:
key_len = tmdb_data['imdb_id'].fillna('').map(len).max()
df_schema = {
    "imdb_id": String(key_len+1),
    'budget':Float(),
    'revenue':Float(),
    'certification':Text(key_len+1)}

In [115]:
tmdb_data.duplicated().sum()

0

In [114]:
tmdb_data = tmdb_data.drop_duplicates()

In [116]:
tmdb_data.to_sql('tmdb_data',engine,dtype=df_schema,if_exists='replace',index=False)

168

In [117]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [102]:
# First 5 rows from title_basics table
q = """SELECT * 
FROM title_basics
LIMIT 5;"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

In [103]:
# First 5 rows from title_genres table
q = """SELECT * 
FROM title_genres
LIMIT 5;"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [104]:
# First 5 rows from title_ratings table
q = """SELECT * 
FROM title_ratings
LIMIT 5;"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1957
1  tt0000002            5.8       263
2  tt0000005            6.2      2593
3  tt0000006            5.1       177
4  tt0000007            5.4       812

In [105]:
# First 5 rows from genres table
q = """SELECT * 
FROM genres
LIMIT 5;"""
pd.read_sql(q, engine)

   Genre_ID Genre_Name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

In [118]:
# First 5 rows from tmdb_data table
q = """SELECT * 
FROM tmdb_data
LIMIT 5;"""
pd.read_sql(q, engine)

     imdb_id      budget      revenue certification
0          0         NaN          NaN          None
1  tt0118694    150000.0   12855000.0            PG
2  tt0120467    120000.0      14904.0             R
3  tt0120630  45000000.0  224835000.0             G
4  tt0120753   8000000.0     105983.0             R

In [119]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data